tests/performance/artillery-realtime-ci.yml
# Lightweight realtime Worker performance smoke for GitHub Actions.
#
# The full WebSocket load profile requires seeded auth state and valid realtime
# JWT payloads. This CI profile keeps the push gate deterministic by exercising
# the realtime Worker health path under small concurrent HTTP load.
config:
  target: "http://localhost:8788"
  phases:
    - duration: 20
      arrivalRate: 3
      rampTo: 8
      name: "CI realtime smoke"

  http:
    timeout: 10
    pool: 10

  ensure:
    - http.response_time.p95:
        max: 2000
    - http.response_time.p99:
        max: 3000

  plugins:
    expect: {}

scenarios:
  - name: "Realtime health endpoint"
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: "status"